[
  {
    "image": "https://i.ibb.co/PzD9HHV/agriculturalland.jpg",
    "estate_title": "Beautiful Farmhouse",
    "id": 1,
    "segment_name": "Agricultural Land",
    "description": "This spacious farmhouse offers countryside living with ample land for farming.",
    "detailed_description": "Situated on 5 acres of lush land, this beautiful farmhouse features a spacious interior with modern amenities and rustic charm. The main house includes multiple bedrooms, a large kitchen, and a cozy living area with a fireplace. Outside, you'll find expansive gardens, a barn for livestock or equipment storage, and plenty of space for outdoor activities. Whether you're a seasoned farmer or simply seeking a quiet countryside escape, this property offers endless possibilities. Enjoy morning walks through the fields, evenings by the fire, and weekends hosting family and friends for gatherings and celebrations.",
    "price": 500000,
    "status": "SALE",
    "area": "5 acres",
    "location": "Brussels, Belgium",
    "facilities": [
      "Fertile soil for agriculture",
      "Water irrigation system",
      "Barn or storage facilities",
      "Livestock pens or shelters"
    ]
  },
  {
    "image": "https://i.ibb.co/gSdnzTR/ranch.jpg",
    "estate_title": "Sprawling Ranch Retreat",
    "id": 2,
    "segment_name": "Ranch",
    "description": "Experience the beauty of wide-open spaces and rustic charm on this expansive ranch.",
    "detailed_description": "Nestled on 100 acres of pristine land, this sprawling ranch retreat offers unparalleled privacy and tranquility. The property features a mix of rolling pastures, wooded areas, and meandering streams, providing the perfect setting for outdoor adventures. The main ranch house boasts spacious living areas, cozy bedrooms, and panoramic views of the surrounding landscape. With amenities such as cattle corrals, horse stables, and miles of scenic trails, this property is ideal for equestrian enthusiasts, nature lovers, and those seeking a peaceful retreat in the countryside. Spend your days horseback riding through the fields, fishing in the nearby streams, or simply relaxing on the porch taking in the breathtaking views.",
    "price": 1200000,
    "status": "RENT",
    "area": "100 acres",
    "location": "Antwerp, Belgium",
    "facilities": [
      "Cattle corrals",
      "Horse stables",
      "Trails for horseback riding",
      "Natural water sources"
    ]
  },
  {
    "image": "https://i.ibb.co/jzGcHJ6/vineyard.jpg",
    "estate_title": "Picturesque Vineyard Estate",
    "id": 3,
    "segment_name": "Vineyard",
    "description": "Own a piece of wine country paradise with this stunning vineyard estate offered.",
    "detailed_description": "Situated amidst rolling hills and lush vineyards, this picturesque estate embodies the essence of wine country living. The property features a thriving vineyard, producing a variety of grapes for award-winning wines. The main estate house exudes charm and elegance, with spacious living areas, gourmet kitchen, and sweeping views of the surrounding landscape. Additional amenities include a wine cellar, tasting room, and outdoor entertaining spaces, making it the perfect setting for hosting events and gatherings. Indulge in wine tastings, vineyard tours, and scenic walks through the vineyards as you soak in the beauty and tranquility of this idyllic wine country estate.",
    "price": 3500000,
    "status": "SALE",
    "area": "50 acres",
    "location": "Ghent, Belgium",
    "facilities": [
      "Grape vineyards",
      "Winery and tasting room",
      "Wine cellar",
      "Event space"
    ]
  },
  {
    "image": "https://i.ibb.co/HDP31Gf/forest.jpg",
    "estate_title": "Secluded Forest Retreat",
    "id": 4,
    "segment_name": "Forest",
    "description": "Escape to nature with this secluded forest property, perfect for outdoor enthusiasts.",
    "detailed_description": "Immerse yourself in the tranquility of nature with this secluded forest retreat. Surrounded by towering trees and lush foliage, this property offers the ultimate escape from the hustle and bustle of city life. Explore winding trails, listen to the sounds of wildlife, and reconnect with the natural world. The property includes a cozy cabin nestled in the woods, providing a comfortable retreat after a day of outdoor adventures. Whether you're seeking solitude or adventure, this forest retreat offers the perfect setting for relaxation and rejuvenation. Spend your days hiking through the forest, birdwatching, or simply enjoying the peaceful sounds of nature from the comfort of your own private sanctuary.",
    "price": 800000,
    "status": "RENT",
    "area": "200 acres",
    "location": "Liege, Belgium",
    "facilities": [
      "Mature forest trees",
      "Trails for hiking and biking",
      "Camping sites",
      "Wildlife viewing"
    ]
  },
  {
    "image": "https://i.ibb.co/zGv45FN/plantation.jpg",
    "estate_title": "Historic Plantation Estate",
    "id": 5,
    "segment_name": "Plantation",
    "description": "Step back in time with this historic plantation, offering grand architecture.",
    "detailed_description": "Experience the grandeur of the past with this historic plantation estate. Set amidst sprawling gardens and manicured lawns, this property exudes elegance and charm. The main plantation house features stunning architecture, spacious interiors, and luxurious amenities. Explore the grounds and discover hidden gardens, tranquil ponds, and scenic vistas. With its rich history and timeless beauty, this plantation estate offers a unique opportunity to own a piece of Southern heritage. Host elegant garden parties, romantic weddings, or intimate gatherings as you create lasting memories in this enchanting plantation setting.",
    "price": 2750000,
    "status": "SALE",
    "area": "150 acres",
    "location": "Charleroi, Belgium",
    "facilities": [
      "Manor house",
      "Formal gardens",
      "Plantation crops",
      "Outbuildings"
    ]
  },
  {
    "image": "https://i.ibb.co/WBbPYtB/farm.jpg",
    "estate_title": "Charming Family Farm",
    "id": 6,
    "segment_name": "Farm",
    "description": "Experience the joys of country living on this charming family farm, perfect for farming.",
    "detailed_description": "Escape to the countryside with this charming family farm. Nestled amidst rolling hills and scenic landscapes, this property offers a peaceful retreat from the hustle and bustle of city life. The farm features fertile fields for cultivating crops, spacious barns for livestock, and a cozy farmhouse for comfortable living. Spend your days tending to the land, exploring nature trails, or simply enjoying the tranquility of rural life. Whether you're a seasoned farmer or seeking a weekend getaway, this charming farm offers endless possibilities. Grow your own vegetables, raise chickens or goats, and enjoy the simple pleasures of country living in this idyllic farm setting.",
    "price": 600000,
    "status": "RENT",
    "area": "20 acres",
    "location": "Bruges, Belgium",
    "facilities": [
      "Crop fields",
      "Livestock pens",
      "Farmhouse",
      "Tractor and equipment shed"
    ]
  }
]
